{
  "Year1": {
    "Home Row Practice": [
      {
        "description": "Practice the home row keys: type asdf jkl;",
        "expected": "asdf jkl;"
      },
      {
        "description": "Type in this order: f d s a l k j ;",
        "expected": "fdsalkj;"
      }
    ],
    "Type Two-Letter Words": [
      {
        "description": "Type the word: an",
        "expected": "an"
      },
      {
        "description": "Type the word: it",
        "expected": "it"
      },
      {
        "description": "Type the word: up",
        "expected": "up"
      }
    ]
  },
  "Year2": {
    "Type Three-Letter Words": [
      {
        "description": "Type the word: cat",
        "expected": "cat"
      },
      {
        "description": "Type the word: dog",
        "expected": "dog"
      },
      {
        "description": "Type the word: sun",
        "expected": "sun"
      }
    ],
    "Typing Simple Sentences": [
      {
        "description": "Type this sentence exactly: The cat runs fast.",
        "expected": "The cat runs fast."
      },
      {
        "description": "Type this sentence: I like to read books.",
        "expected": "I like to read books."
      }
    ]
  },
  "Year3": {
    "Typing Short Paragraphs": [
      {
        "description": "Type the paragraph exactly:\n\nMy name is John. I like school. I play football every day.",
        "expected": "My name is John. I like school. I play football every day."
      },
      {
        "description": "Type the paragraph:\n\nI have a pet dog. It is very friendly. I take care of it.",
        "expected": "I have a pet dog. It is very friendly. I take care of it."
      }
    ]
  },
  "Year4": {
    "Typing Sentences": [
      {
        "description": "Type this sentence: Learning is fun when we practice daily.",
        "expected": "Learning is fun when we practice daily."
      },
      {
        "description": "Type this sentence: My favourite subject is Mathematics.",
        "expected": "My favourite subject is Mathematics."
      }
    ]
  },
  "Year5": {
    "Typing Short Paragraphs": [
      {
        "description": "Type the paragraph: I enjoy reading stories about animals. It helps me learn new things.",
        "expected": "I enjoy reading stories about animals. It helps me learn new things."
      },
      {
        "description": "Type the paragraph: The sun rises in the east and sets in the west.",
        "expected": "The sun rises in the east and sets in the west."
      }
    ]
  },
  "Year6": {
    "Typing Paragraphs": [
      {
        "description": "Type the paragraph: I went to the park today. The flowers were beautiful and the birds were singing.",
        "expected": "I went to the park today. The flowers were beautiful and the birds were singing."
      },
      {
        "description": "Type the paragraph: My family and I had a picnic by the river. We played games and ate delicious food.",
        "expected": "My family and I had a picnic by the river. We played games and ate delicious food."
      }
    ]
  },
  "Year7": {
    "Typing Medium Paragraphs": [
      {
        "description": "Type the paragraph: Education is important for a bright future. Students should study hard and practice daily.",
        "expected": "Education is important for a bright future. Students should study hard and practice daily."
      },
      {
        "description": "Type the paragraph: Good habits help us grow into responsible and kind individuals.",
        "expected": "Good habits help us grow into responsible and kind individuals."
      }
    ]
  },
  "Year8": {
    "Typing Essays": [
      {
        "description": "Type the essay: My favourite hobby is reading books. I enjoy learning new words and exploring different stories. Reading improves my imagination and writing skills.",
        "expected": "My favourite hobby is reading books. I enjoy learning new words and exploring different stories. Reading improves my imagination and writing skills."
      }
    ]
  },
  "Year9": {
    "Typing Reports": [
      {
        "description": "Type the report: The school organized a science fair. Students presented projects about plants, animals, and technology. The event was informative and fun.",
        "expected": "The school organized a science fair. Students presented projects about plants, animals, and technology. The event was informative and fun."
      }
    ]
  },
  "Year10": {
    "Typing Research Papers": [
      {
        "description": "Type the research paper: Climate change affects weather patterns worldwide. Governments and citizens must take action to reduce carbon emissions and protect the environment.",
        "expected": "Climate change affects weather patterns worldwide. Governments and citizens must take action to reduce carbon emissions and protect the environment."
      }
    ]
  },
  "Year11": {
    "Typing Theses": [
      {
        "description": "Type the thesis excerpt: Renewable energy sources like solar and wind power are crucial for sustainable development. Research shows they can significantly reduce greenhouse gas emissions.",
        "expected": "Renewable energy sources like solar and wind power are crucial for sustainable development. Research shows they can significantly reduce greenhouse gas emissions."
      }
    ]
  },
  "Year12": {
    "Typing Dissertations": [
      {
        "description": "Type the dissertation excerpt: Advanced artificial intelligence applications in healthcare improve diagnostics, treatment planning, and patient monitoring. Ethical considerations are paramount.",
        "expected": "Advanced artificial intelligence applications in healthcare improve diagnostics, treatment planning, and patient monitoring. Ethical considerations are paramount."
      },
      {
        "description": "Type the dissertation excerpt: Sustainable urban planning reduces pollution, enhances quality of life, and supports economic growth. Collaborative efforts between governments and communities are essential.",
        "expected": "Sustainable urban planning reduces pollution, enhances quality of life, and supports economic growth. Collaborative efforts between governments and communities are essential."
      }
    ]
  }
}
